/********************************************************************
        c_prac_cnv.c

                        変換処理
********************************************************************/
#include "c_prac_cnv.h"

/*
関数名                  機能
----------------------- ---------------------------------------------
NumCharToInt            数記号を数値化
*/

/********************************************************************
        int NumCharToInt(
                int c   // 文字コード
        );
        返し値
                成功 : 数記号を数値化した値
                失敗 : 数記号ではない : MacErr_NotNumChar
        処理詳細
                文字コードが数記号であればそれを数値化して返す。
                数記号で無ければその旨を返す。
********************************************************************/
int NumCharToInt(int c)
{
    if ((c > '9') || (c < '0'))
    {
        return (MacErr_NotNumChar);
    }
    return (c - '0');
}